## pandas 기초연습문제

In [1]:
import pandas as pd #pandas를 pd라는 이름으로 가져오기

In [2]:
score={'학번':[201524213,201621223,201621233, 201611111, 201722222],
       '이름':['오지환','박용택','정성훈', '다니엘', '지민'],
       '학과':['경영정보','경영정보','경영정보','컴퓨터공학','컴퓨터공학'],
       'Quiz':[15,20,10,17,18],
       '중간고사':[20,20,15,18,16]}

df= pd.DataFrame(score)
df #score를 데이터프레임으로 만들기

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
2  201621233  정성훈   경영정보    10    15
3  201611111  다니엘  컴퓨터공학    17    18
4  201722222   지민  컴퓨터공학    18    16

In [3]:
df['학번'] #학번만 추출

0    201524213
1    201621223
2    201621233
3    201611111
4    201722222
Name: 학번, dtype: int64

In [4]:
df[['이름','중간고사']] #이름이랑 중간고사만 추출

    이름  중간고사
0  오지환    20
1  박용택    20
2  정성훈    15
3  다니엘    18
4   지민    16

In [6]:
df=df.reindex([2,0,4,1,3])
df #순서 바꾸기

          학번   이름     학과  Quiz  중간고사
2  201621233  정성훈   경영정보    10    15
0  201524213  오지환   경영정보    15    20
4  201722222   지민  컴퓨터공학    18    16
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18

In [18]:
print(df.iloc[3])# 2번째 순서에 있는 정보 가져요기
print(df.loc[1])  # 명칭이 정보가져오기

학번      201621223
이름            박용택
학과           경영정보
Quiz           20
중간고사           20
Name: 1, dtype: object
학번      201621223
이름            박용택
학과           경영정보
Quiz           20
중간고사           20
Name: 1, dtype: object

In [19]:
print(df.iloc[:, [1, 4]])
print(df.loc[:, ['이름', '중간고사']])

    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18
    이름  중간고사
2  정성훈    15
0  오지환    20
4   지민    16
1  박용택    20
3  다니엘    18

In [20]:
df['중간고사'].mean() #mean 함수를 써 평균 구하기

17.8

In [23]:
df['중간고사'].idxmin()  #inxmin함수를 통해서 중간고사 점수가 가장 낮은 학생의 index구하기

2

In [25]:
df.loc[df['Quiz'].idxmax(), '학번'] #퀴즈의 점수가 가장높은 아이 학번 가져오기

201621223

In [26]:
df.describe() #통계량 출력

                 학번       Quiz       중간고사
count  5.000000e+00   5.000000   5.000000
mean   2.016200e+08  16.000000  17.800000
std    7.018995e+04   3.807887   2.280351
min    2.015242e+08  10.000000  15.000000
25%    2.016111e+08  15.000000  16.000000
50%    2.016212e+08  17.000000  18.000000
75%    2.016212e+08  18.000000  20.000000
max    2.017222e+08  20.000000  20.000000

In [27]:
df.sort_values('중간고사', ascending=False) #sort를 통해 중간고사 점수가 높은 학생부터 내림차순 정렬

          학번   이름     학과  Quiz  중간고사
0  201524213  오지환   경영정보    15    20
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18
4  201722222   지민  컴퓨터공학    18    16
2  201621233  정성훈   경영정보    10    15

In [29]:
quiz_mean = df['Quiz'].mean()
df[df['Quiz'] >quiz_mean]['이름'] #퀴즈의 평균 점수보다 높은 아이 가져오기

4     지민
1    박용택
3    다니엘
Name: 이름, dtype: object

In [30]:
quiz_mean=df['Quiz'].mean()
mid_mean=df['중간고사'].mean()
df[(df['Quiz'] > quiz_mean) & (df['중간고사'] > mid_mean)] #퀴즈와 중간고사 점수 모두 평균보다 높은 아이 가져오기

          학번   이름     학과  Quiz  중간고사
1  201621223  박용택   경영정보    20    20
3  201611111  다니엘  컴퓨터공학    17    18

In [31]:
df['학과'].value_counts() #학과별 학생 수 출력하기

경영정보     3
컴퓨터공학    2
Name: 학과, dtype: int64

In [32]:
df.groupby('학과')['중간고사'].mean() #학과별 평균 구하기

학과
경영정보     18.333333
컴퓨터공학    17.000000
Name: 중간고사, dtype: float64

In [35]:
 df.mean()

학번      201620000.4
Quiz           16.0
중간고사           17.8
dtype: float64

In [33]:
list(df.groupby('학과'))

[('경영정보',
            학번   이름    학과  Quiz  중간고사
  2  201621233  정성훈  경영정보    10    15
  0  201524213  오지환  경영정보    15    20
  1  201621223  박용택  경영정보    20    20),
 ('컴퓨터공학',
            학번   이름     학과  Quiz  중간고사
  4  201722222   지민  컴퓨터공학    18    16
  3  201611111  다니엘  컴퓨터공학    17    18)]